# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries

brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
#brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'php@7.0'
brew 'composer'
brew 'imagemagick'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'node@10'
brew 'node@8'
#brew 'redis'

# Apps
cask 'tor-browser'
cask 'google-chrome'
cask 'insomnia'
cask 'sip'
cask 'sublime-text'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'cyberduck'
cask 'webtorrent'
cask 'vlc'
cask 'the-unarchiver'
cask 'sequel-pro-nightly'

# Quicklook
cask 'WebPQuickLook'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
